

msg_dict = {
    'command-start': 'Привет, давай начнем поиск!',
    'command-help': 'Здесь будет сообщение на команду /help',

    'admin-commands': 'Ваши команды:\n\n'
                      '/send_everyone - отправить сообщение всем пользователям\n\n'
                      '/new_file - Обновить файл для поиска\n\n'
                      '/users_count - Количество пользователей',
    'admin-bot-started': 'Бот запущен',
    'ask-price': 'Cколько готов потратить на отдых?"\n'
                 'Введи ответ в формате МИНИМУМ - МАКСИМУМ\n'
                 'Например: 10000 - 15000\n\n'
                 '❗️ Внимание, цена должна быть указана так, как показано на примере (рублях). Никаких точек, запятых.',
    'ask-schengen': 'У вас есть шенген?\nОтветьте на вопрос кнопками ниже.',
    'ask-people': 'Сколько человек идут отдыхать, включая вас?\nОтвет только цифрами, например: 1, 4, 8.',
    'ask-days': 'На сколько дней вы собираетесь поехать на отдых?\nОтвет только цифрами, например: 1, 4, 8.',
    'ask-sea': 'Хотели бы побывать на море?\nОтветьте на вопрос кнопками ниже.',
    'ask-sure': 'Все введенные вами данные верны?\n\n'
                'Цена: от *{0}* до *{1} рублей*\n'
                'Шенген: *{2}*\n'
                'Всего людей: *{3}*\n'
                'Длительность поездки: *{4}* дней\n'
                'Желание побыть на море: *{5}*\n\n'
                'Если все данные верны, нажмите на кнопку "Да", если данные неверны, '
                'нажмите на кнопку "Нет", и пройдите опрос заново.',

    'wrong-price': 'Вы ввели неверный ответ!\nПожалуйста, введите сумму так, как указано на примере.'
                   'Например: 10000 - 15000\n\nЦена должна быть указана рублях и без никаких точек и запятых.',
    'wrong-schengen': 'Ответьте на вопрос "У вас есть шенген?" кнопками "Да" или "Нет".',
    'wrong-people': 'Ответьте на вопрос "Сколько человек идут отдыхать, включая вас?" только числами!',
    'wrong-days': 'Ответьте на вопрос "На сколько дней вы собираетесь поехать на отдых?" только числами!',
    'wrong-sea': 'Ответьте на вопрос "Хотели бы побывать на море?" кнопками "Да" или "Нет".',
    'wrong-sure': 'Ответьте на вопрос "Все введенные вами данные верны?" кнопками "Да" или "Нет".',

    'searching': 'Пожалуйста, подождите...\nИдет поиск.',
}