

msg_dict = {
    'command-start': 'Привет, я помогу тебе определиться куда поехать отдохнуть, исходя из твоего бюджета)',
    'command-help': 'Если у тебя есть предложения/замечания, то свяжись со мной.'
                    'Я с радостью их приму к сведению. Пишите мне ',

    'admin-commands': 'Ваши команды:\n\n'
                      '/send_everyone - отправить сообщение всем пользователям\n\n'
                      '/new_file - Обновить файл для поиска\n\n'
                      '/users_count - Количество пользователей',
    'admin-bot-started': 'Бот запущен',
    'action-rejected': 'Вы отменили действия',
    'ask-price': 'Сколько ты готов потратить на отдых?"\n'
                 '❗️ Введи диапазон в формате ОТ - ДО (в рублях на человека)\n'
                 'Например: 100000-110000\n\n'
                 '❗️ Внимание, сумма должна быть указана так, как показано на примере. Без точек и запятых.',
    'ask-schengen': 'У тебя есть шенген?\n❗️ Ответьте на вопрос кнопками ниже.',
    'ask-people': 'Сколько человек с тобой едет, включая тебя?\n❗️ Ответ только цифрами, например: 1, 4, 8.',
    'ask-days': 'А на сколько дней?\n❗️ Ответ только цифрами, например: 1, 4, 8.',
    'ask-sea': 'На море хочешь?\n❗️ Ответьте на вопрос кнопками ниже.',
    'ask-sure': 'Все введенные тобой данные верны?\n\n'
                'Общий бюджет за *{0}* человек(а) на *{1}* дня(ей) составляет: *{2} - {3}* рублей\n'
                'Пляжный отдых: *{4}*\n'
                'Шенген: *{5}*\n\n'
                'Если все данные верны, нажми на кнопку "Да", если данные неверны, '
                'нажми на кнопку "Нет", и начни поиск заново.',

    'wrong-price': 'Вы ввели неверный ответ!\n❗️ Пожалуйста, введите сумму так, как указано на примере.'
                   'Например: 10000 - 15000\n\n❗️ Сумма должна быть указана в рублях без точек и запятых.',
    'wrong-schengen': '❗️ Ответьте на вопрос "У тебя есть шенген?" кнопками "Да" или "Нет".',
    'wrong-people': '❗️ Ответьте на вопрос "Сколько человек едет отдыхать, включая тебя?" только числами!',
    'wrong-days': '❗️ Ответь на вопрос "На сколько дней ты собираешься поехать отдыхать?" только числами!',
    'wrong-sea': '❗️ Ответьте на вопрос "На море хочешь?" кнопками "Да" или "Нет".',
    'wrong-sure': '❗️ Ответьте на вопрос "Все введенные тобой данные верны?" кнопками "Да" или "Нет".',
    'action': '❗️ Выбери правильное действие кнопками "Да" или "Нет".',

    'searching': 'Так, так, так, сейчас посмотрим.',
    'search-results': '_По запросу найдено:_\n\n{}',
}