

msg_dict = {
    'command-start': 'Привет, я помогу тебе определиться куда поехать отдохнуть, исходя из твоего бюджета)',
    'command-help': 'Если у тебя есть предложения/замечания, то свяжись со мной +79160991741. Я с радостью их выслушаю.',

    'admin-commands': 'Ваши команды:\n\n'
                      '/send_everyone - отправить сообщение всем пользователям\n\n'
                      '/new_file - Обновить файл для поиска\n\n'
                      '/users_count - Количество пользователей',
    'admin-bot-started': 'Бот запущен',
    'action-rejected': 'Вы отменили действия',
    'ask-price': 'Сколько ты готов потратить на отдых?"\n'
                 'Введи точную сумму или диапазон в формате ОТ - ДО (в рублях на человека)\n'
                 'Например: 10000 - 15000\n\n'
                 '❗️ Внимание, цена должна быть указана так, как показано на примере. Никаких точек, запятых.',
    'ask-schengen': 'У тебя есть шенген?\nОтветьте на вопрос кнопками ниже.',
    'ask-people': 'Сколько человек с тобой едет, включая тебя?\nОтвет только цифрами, например: 1, 4, 8.',
    'ask-days': 'А на сколько дней?\nОтвет только цифрами, например: 1, 4, 8.',
    'ask-sea': 'На море хочешь?\nОтветьте на вопрос кнопками ниже.',
    'ask-sure': 'Все введенные вами данные верны?\n\n'
                'Цена: от *{0}* до *{1} рублей* на человека\n'
                'Шенген: *{2}*\n'
                'Всего людей: *{3}*\n'
                'Длительность поездки: *{4}* дня(ей)\n'
                'Желание побыть на море: *{5}*\n\n'
                'Если все данные верны, нажмите на кнопку "Да", если данные неверны, '
                'нажмите на кнопку "Нет", и пройдите опрос заново.',

    'wrong-price': 'Вы ввели неверный ответ!\nПожалуйста, введите сумму так, как указано на примере.'
                   'Например: 10000 - 15000\n\nЦена должна быть указана рублях и без никаких точек и запятых.',
    'wrong-schengen': 'Ответьте на вопрос "У вас есть шенген?" кнопками "Да" или "Нет".',
    'wrong-people': 'Ответьте на вопрос "Сколько человек идут отдыхать, включая вас?" только числами!',
    'wrong-days': 'Ответьте на вопрос "На сколько дней вы собираетесь поехать на отдых?" только числами!',
    'wrong-sea': 'Ответьте на вопрос "Хотели бы побывать на море?" кнопками "Да" или "Нет".',
    'wrong-sure': 'Ответьте на вопрос "Все введенные вами данные верны?" кнопками "Да" или "Нет".',

    'searching': 'Пожалуйста, подождите...\nИдет поиск.',
    'search-results': '_Найдено по запросу_\n\n'
                      'Цена за одного человека: *{0}* - *{1}* рублей\n'
                      'Бюджет за *{2}* человек(а) на *{3}* дня(ей): *{4}* - *{5}* рублей\n'
                      'Желание побыть на море: *{6}*\n'
                      'Шенген: *{7}*\n\n'
                      '{8}',
}